## Using SQL

In [1]:
#import necessary packages 
import sqlite3
import pandas as pd

In [2]:
# connect database and create cursor
conn = sqlite3.connect('nba_salary.sqlite')
cur = conn.cursor()

In [3]:
# executing the query to select all rows from first 5 entries in first table 
cur.execute("""SELECT * FROM NBA_season1718_salary LIMIT 5;""")

In [4]:
#Create the answer variable 
ans = cur.fetchall()

In [5]:
#Print the result of the query
print(ans)

[(1.0, 'Stephen Curry', 'GSW', 34682550.0), (2.0, 'LeBron James', 'CLE', 33285709.0), (3.0, 'Paul Millsap', 'DEN', 31269231.0), (4.0, 'Gordon Hayward', 'BOS', 29727900.0), (5.0, 'Blake Griffin', 'DET', 29512900.0)]

In [6]:
# executing the query to select all rows from first 5 entries in second table 
cur.execute("""SELECT * FROM Seasons_Stats LIMIT 5;""")

In [7]:
#Create the answer variable for the above query  
ans2 = cur.fetchall()

In [8]:
#Print the result of the query
print(ans2)

[(0.0, 1950.0, 'Curly Armstrong', 'G-F', 31.0, 'FTW', 63.0, None, None, None, 0.368, None, 0.467, None, None, None, None, None, None, None, None, None, -0.1, 3.6, 3.5, None, None, None, None, None, None, 144.0, 516.0, 0.279, None, None, None, 144.0, 516.0, 0.279, 0.279, 170.0, 241.0, 0.705, None, None, None, 176.0, None, None, None, 217.0, 458.0), (1.0, 1950.0, 'Cliff Barker', 'SG', 29.0, 'INO', 49.0, None, None, None, 0.435, None, 0.387, None, None, None, None, None, None, None, None, None, 1.6, 0.6, 2.2, None, None, None, None, None, None, 102.0, 274.0, 0.372, None, None, None, 102.0, 274.0, 0.372, 0.372, 75.0, 106.0, 0.708, None, None, None, 109.0, None, None, None, 99.0, 279.0), (2.0, 1950.0, 'Leo Barnhorst', 'SF', 25.0, 'CHS', 67.0, None, None, None, 0.394, None, 0.259, None, None, None, None, None, None, None, None, None, 0.9, 2.8, 3.6, None, None, None, None, None, None, 174.0, 499.0, 0.349, None, None, None, 174.0, 499.0, 0.349, 0.349, 90.0, 129.0, 0.698, None, None, None, 140.0, None, None, None, 192.0, 438.0), (3.0, 1950.0, 'Ed Bartels', 'F', 24.0, 'TOT', 15.0, None, None, None, 0.312, None, 0.395, None, None, None, None, None, None, None, None, None, -0.5, -0.1, -0.6, None, None, None, None, None, None, 22.0, 86.0, 0.256, None, None, None, 22.0, 86.0, 0.256, 0.256, 19.0, 34.0, 0.559, None, None, None, 20.0, None, None, None, 29.0, 63.0), (4.0, 1950.0, 'Ed Bartels', 'F', 24.0, 'DNN', 13.0, None, None, None, 0.308, None, 0.378, None, None, None, None, None, None, None, None, None, -0.5, -0.1, -0.6, None, None, None, None, None, None, 21.0, 82.0, 0.256, None, None, None, 21.0, 82.0, 0.256, 0.256, 17.0, 31.0, 0.548, None, None, None, 20.0, None, None, None, 27.0, 59.0)]

In [9]:
cur.execute("""SELECT X1, Year, Player, Pos, Age, Tm, G FROM Seasons_Stats;""")

In [10]:
#convert to Dataframe
df = pd.DataFrame(cur.fetchall())
df.head()

     0       1                2    3     4    5     6
0  0.0  1950.0  Curly Armstrong  G-F  31.0  FTW  63.0
1  1.0  1950.0     Cliff Barker   SG  29.0  INO  49.0
2  2.0  1950.0    Leo Barnhorst   SF  25.0  CHS  67.0
3  3.0  1950.0       Ed Bartels    F  24.0  TOT  15.0
4  4.0  1950.0       Ed Bartels    F  24.0  DNN  13.0

In [11]:
df.columns = ['ID', 'Year', 'Player', 'Position', 'Age', 'Team', 'Game']

In [12]:
df.head()

    ID    Year           Player Position   Age Team  Game
0  0.0  1950.0  Curly Armstrong      G-F  31.0  FTW  63.0
1  1.0  1950.0     Cliff Barker       SG  29.0  INO  49.0
2  2.0  1950.0    Leo Barnhorst       SF  25.0  CHS  67.0
3  3.0  1950.0       Ed Bartels        F  24.0  TOT  15.0
4  4.0  1950.0       Ed Bartels        F  24.0  DNN  13.0